{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.16.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "output_2": {"name": "Identity_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1989205"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "130792"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1989205"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/brute_force/Gather/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/brute_force/model/Cast", "op": "Cast", "input": ["input_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/brute_force/model/Cast"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/brute_force/model/embedding/Cast", "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup", "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/brute_force/model/average_pooling1d/Squeeze", "StatefulPartitionedCall/brute_force/model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/brute_force/model/flatten/Reshape", "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": true}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2", "op": "TopKV2", "input": ["StatefulPartitionedCall/brute_force/MatMul", "StatefulPartitionedCall/brute_force/TopKV2/k"], "attr": {"sorted": {"b": true}, "index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tk": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/Gather", "op": "GatherV2", "input": ["unknown_1", "StatefulPartitionedCall/brute_force/TopKV2:1", "StatefulPartitionedCall/brute_force/Gather/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/TopKV2", "^StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of51.bin", "group1-shard2of51.bin", "group1-shard3of51.bin", "group1-shard4of51.bin", "group1-shard5of51.bin", "group1-shard6of51.bin", "group1-shard7of51.bin", "group1-shard8of51.bin", "group1-shard9of51.bin", "group1-shard10of51.bin", "group1-shard11of51.bin", "group1-shard12of51.bin", "group1-shard13of51.bin", "group1-shard14of51.bin", "group1-shard15of51.bin", "group1-shard16of51.bin", "group1-shard17of51.bin", "group1-shard18of51.bin", "group1-shard19of51.bin", "group1-shard20of51.bin", "group1-shard21of51.bin", "group1-shard22of51.bin", "group1-shard23of51.bin", "group1-shard24of51.bin", "group1-shard25of51.bin", "group1-shard26of51.bin", "group1-shard27of51.bin", "group1-shard28of51.bin", "group1-shard29of51.bin", "group1-shard30of51.bin", "group1-shard31of51.bin", "group1-shard32of51.bin", "group1-shard33of51.bin", "group1-shard34of51.bin", "group1-shard35of51.bin", "group1-shard36of51.bin", "group1-shard37of51.bin", "group1-shard38of51.bin", "group1-shard39of51.bin", "group1-shard40of51.bin", "group1-shard41of51.bin", "group1-shard42of51.bin", "group1-shard43of51.bin", "group1-shard44of51.bin", "group1-shard45of51.bin", "group1-shard46of51.bin", "group1-shard47of51.bin", "group1-shard48of51.bin", "group1-shard49of51.bin", "group1-shard50of51.bin", "group1-shard51of51.bin"], "weights": [{"name": "unknown_1", "shape": [1989205], "dtype": "int32"}, {"name": "unknown", "shape": [130792, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/model/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/model/average_pooling1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "shape": [1989205, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/Gather/axis", "shape": [], "dtype": "int32"}]}]}